{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/simple-storage-network",
  "promos": {
    "1.16.4-latest": "1.3.3",
    "1.16.4-recommended": "1.3.3"
  },
  "1.16.4": {
   	"1.0.1":"Ported to the latest forge version to fix rendering issues (tooltips, player models transparent, etc)"
   	,"1.1.0":"Fixed compatibility crashe caused by breaking changes in the latest forge/JEI (suggested now is forge_version=33.0.61 and jei_version=7.3.2.25).  Patched bug in native VoxelShape class for joining server lag.  Regular Network Cables no longer visually appear to connect to inventories.  Several recipes updated to use item tags for compatibility.   "
  	,"1.1.2":"Fix server crash when you build on top of the main root block."
  	,"1.2.0":"Added new items: Network Picker and Network Collector."
  	,"1.2.1":"Language files pt_br and hu_hu updated "
  	,"1.3.0":"Refactored cable connectivity to rely more on capabilities instead of block comparisons.  Fixed some tooltips. Added Network Collection Interface, Network Exchange Interface, and Network Builder.  (textures and functionality subject to change)"
  	,"1.3.1":"New config option 'enableAutoSearchFocus' for clients to disable the auto-focusing on the text box when a network GUI is opened (thanks to PR by LeoBeliik).  Game no longer crashes if JEI is un-installed from a world.  Catch and handle exceptions safely when Network Interface are connected to an external mod is throwing errors (For example, AE2 error with  Ticking GridNode). Refactor: removed deprecated proxy layer in mod startup.  "
  	,"1.3.2":"New Patchouli book added.  Export cable and Filtered Input Cable now both have redstone control options.  Fix language overflow text when some certain other mods are installed.  Catch exceptions from connected or networked inventory capabilities during insertStack.   "
  	,"1.3.3":"Update pt_br.json by Mikeliro.  Fix server crash when inserting an item stack when some stack or mod throws a StackOverflowError error.  Fix some other ClassDef not found errors.     "
  }
}
