{
	"homepage": "https://www.curseforge.com/minecraft/mc-mods/simple-storage-network",
	"promos": {
		"1.18.1-latest": "1.6.0",
		"1.18.2-latest": "1.6.2",
		"1.19-latest": "1.6.9"
	},
	"1.18.2": {
		"1.4.1": "First port to 1.17.1 ",
		"1.4.2": "Scaled down font size of item stack counts",
		"1.5.0": " Ported to 1.18.  Performance increase: ItemStacks are no longer repeatedly copied while doing sorting/imports/exports, reducing RAM use/CPU load.  Cables can all be now water-loggable. Storage Request Table now correctly drops items from crafting grid when broken.",
		"1.5.1": "Jei got released for 1.18 so enable that plugin",
		"1.5.2": "Ported to 1.18.1. Fixed cables not saving settings such as filter and priority.  Created italian translation #408 by maicol07 .  Bugfixes for Network Collector Remote #411 #394 by Samsterious  ",
		"1.5.3": "Fix for latest forge",
		"1.5.4": "Fix error when placing some network blocks. Updated minimum forge to 39.0.55.  Developed on jei-1.18.1:9.2.1.69 so similar versions are probably fine too.   Fix both remotes not syncing Sort/JEI and other settings on open/close #416   ",
		"1.6.0": "[tested on forge=39.0.75; jei=9.2.1.69] Added new items Singleton Upgrade and Slowness Upgrade. Ported two items Stock Upgrade and Operation upgrade from mc1.12.2.  Changed some of the default recipes to consume less redstone and quartz (see the upgrades).  Removed config 'enableAutoSearchFocus', instead Auto-Focus toggle button added in GUI right-side. Fix #416 remotes not saving options settings. Fixed Network Collector Remote Void Items #414.  Crafting remote no longer saves crafting grid data, drops 3x3 on close (Fixes #434 and other isses).  This allows a new feature where the Crafting Remote can go into the ender chest or Curios slot and be opened by the key binding (i default).  Fix #254 Import Cables stuck on not importable items. ",
		"1.6.1": "Port to MC 1.18.2 by MrBysco, forge 40.0.15 and jei 9.5.0.132.  Added safety checks and workarounds and a config to catch when the screen size and GUI Scale gets too small and crashes seem to come from JEI (illegal negative numbers exceptions guiTop >= 0 check)",
		"1.6.2": "Fixed item-routing cache feature, meaning as items get inserted (by player or cable) it tries to group them together with previous items in the same container when possible (still same logic as 1.12.2 version).  Refactor and clean up how cables connect on placement. Fix the visuals and the selection bounding box for cables sometimes not matching.  Updated to latest dependencies: forge=40.1.54  jei=9.7.0.209  curios=5.0.7.1  Remove/fix slot overlap patch for remotes on very small resolutions. Fix  java.lang.StackOverflowError connecting a Link Cable to a Network Exchange Interface #445 (these blocks now connect as blockstate=cable not =inventory). Optimize/remove redundant connection retries when blocks are placed. "
	},
	"1.19":{
		"1.6.2":"Ported but only works with forge versions 41.0.0 -> 41.0.63-ish, higher versions have errors (next build after this will run with 41.0.85+).  Compiled on forge_version=41.0.62; jei_version=11.0.0.206; curios_version=5.1.0.1; patchouli_version=72"		
	}
}
